---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConstraintFailures.UndeletedConstraintsInGroup
source: html/981f1fe0-3677-874f-947b-3302c6979911.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConstraintFailures.UndeletedConstraintsInGroup Property

A labeled dimension is being deleted, but the corresponding constraint belongs to a group and will not be changed. You can change it in group edit mode later.

## Syntax (C#)
```csharp
public static FailureDefinitionId UndeletedConstraintsInGroup { get; }
```